; domain
(define (domain Quantum)
(:requirements :typing)
(:types pqubit lqubit depth)
(:constants d0 - depth)
(:predicates (occupied_pqubit ?p - pqubit)
             (initialized ?p - pqubit)
             (occupied_lqubit ?l - lqubit)
             (mapped ?l - lqubit ?p - pqubit)
             (connected ?p1 - pqubit ?p2 - pqubit)
             ;; required cnot(control_gate,target_gate) is described as follows at some depth
             (rcnot ?l1 - lqubit ?l2 - lqubit ?d - depth)
             (current_depth ?d - depth)
             (next_depth ?d1 - depth ?d2 - depth)
)

;; In the first step (or depth), the logical qubits to be mapped to some physical qubits
;; We use map initial action for such mapping
;; Since we need the initial mapping first, we use depth s0 with the very first depth

(:action map_initial
:parameters (?l - lqubit ?p - pqubit)
:precondition (and (not (occupied_lqubit ?l)) (not(initialized ?p)))
:effect       (and (occupied_lqubit ?l) (occupied_pqubit ?p) (initialized ?p) (mapped ?l ?p))
)

;; In each depth, we need to satisfy some cnot operations
;; we use swap to swap the mapped logical qubits

(:action swap
:parameters (?l1 - lqubit ?l2 - lqubit ?p1 - pqubit ?p2 - pqubit ?d - depth)
:precondition (and  (mapped ?l1 ?p1) (mapped ?l2 ?p2) (current_depth ?d) (connected ?p1 ?p2) (not(current_depth d0)))
:effect       (and (not (mapped ?l1 ?p1)) (not (mapped ?l2 ?p2)) (mapped ?l1 ?p2) (mapped ?l2 ?p1))
)

;; we can swap with ancilary qubits:
;; we update if qubits are initialized and occupied

(:action swap-ancilary
:parameters (?l1 - lqubit ?p1 - pqubit ?p2 - pqubit ?d - depth)
:precondition (and  (mapped ?l1 ?p1) (not(occupied_pqubit ?p2)) (current_depth ?d) (connected ?p1 ?p2) (not(current_depth d0)))
:effect       (and (not (mapped ?l1 ?p1)) (mapped ?l1 ?p2) (not(occupied_pqubit ?p1)) (occupied_pqubit ?p2) (initialized ?p2))
)


;; After (full/partial) swapping, we need to apply cnot gates
;; only when the physical qubits to which the logical qubits are connected, we can apply the cnot gate in that time step

(:action apply_cnot
:parameters (?l1 - lqubit ?l2 - lqubit ?p1 - pqubit ?p2 - pqubit ?d - depth)
:precondition (and  (mapped ?l1 ?p1) (mapped ?l2 ?p2) (connected ?p1 ?p2) (rcnot ?l1 ?l2 ?d) (current_depth ?d))
:effect       (and (not (rcnot ?l1 ?l2 ?d)))
)

;; Since unitary operators can be swapped (physically) along with qubits, we group cnots together and unitary operators together
;; these form depths, as long as the swapping is done for cnot at each depth the correctness is preserved
;; After each depth, we move to next depth

(:action move_depth
:parameters (?d1 - depth ?d2 - depth) 
:precondition (and (current_depth ?d1) (not (current_depth ?d2)) (next_depth ?d1 ?d2))
:effect       (and (not (current_depth ?d1)) (current_depth ?d2))
)

)

; problem
(define (problem test)  (:domain Quantum)
  (:objects
  ;; logical qubits
  l0 l1 l2 - lqubit
  ;; physical qubits
  p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - pqubit
  ;; layer depth
  d2 d4 d5 d6 d7 d8 - depth
  )
(:init
  ;; all physical qubits are not occupied, by default
  ;; all logical qubits are not occupied, by default
  ;; current depth is d0
  (current_depth d0)
  ;; connectivity graph
  (connected p1 p0)
  (connected p1 p2)
  (connected p2 p3)
  (connected p4 p3)
  (connected p4 p10)
  (connected p5 p4)
  (connected p5 p6)
  (connected p5 p9)
  (connected p6 p8)
  (connected p7 p8)
  (connected p9 p8)
  (connected p9 p10)
  (connected p11 p3)
  (connected p11 p10)
  (connected p11 p12)
  (connected p12 p2)
  (connected p13 p1)
  (connected p13 p12)
  (connected p0 p1)
  (connected p2 p1)
  (connected p3 p2)
  (connected p3 p4)
  (connected p10 p4)
  (connected p4 p5)
  (connected p6 p5)
  (connected p9 p5)
  (connected p8 p6)
  (connected p8 p7)
  (connected p8 p9)
  (connected p10 p9)
  (connected p3 p11)
  (connected p10 p11)
  (connected p12 p11)
  (connected p2 p12)
  (connected p1 p13)
  (connected p12 p13)
  ;; depths
  (next_depth d0 d2)
  (next_depth d2 d4)
  (next_depth d4 d5)
  (next_depth d5 d6)
  (next_depth d6 d7)
  (next_depth d7 d8)
  ;; listing required cnots
  (rcnot l2 l1 d2)
  (rcnot l0 l1 d4)
  (rcnot l2 l0 d5)
  (rcnot l2 l1 d6)
  (rcnot l2 l0 d7)
  (rcnot l0 l1 d8)
)
(:goal
  (and
  ;; depth 0, initial mapping
  (occupied_lqubit l0)
  (occupied_lqubit l1)
  (occupied_lqubit l2)
  ;; listing negated required cnots
 (not (rcnot l2 l1 d2))
 (not (rcnot l0 l1 d4))
 (not (rcnot l2 l0 d5))
 (not (rcnot l2 l1 d6))
 (not (rcnot l2 l0 d7))
 (not (rcnot l0 l1 d8))
  )
)
)

; plan
1. (map_initial l0 p0)
   added: (occupied_lqubit l0) (occupied_pqubit p0) (initialized p0) (mapped l0 p0)
   goals met: 1 of 9
2. (map_initial l2 p13)
   added: (occupied_lqubit l2) (occupied_pqubit p13) (initialized p13) (mapped l2 p13)
   goals met: 2 of 9
3. (map_initial l1 p1)
   added: (occupied_lqubit l1) (occupied_pqubit p1) (initialized p1) (mapped l1 p1)
   goals met: 3 of 9
4. (move_depth d0 d2)
   deleted: (current_depth d0)
   added: (current_depth d2)
   goals met: 3 of 9
5. (apply_cnot l2 l1 p13 p1 d2)
   deleted: (rcnot l2 l1 d2)
   goals met: 4 of 9
6. (move_depth d2 d4)
   deleted: (current_depth d2)
   added: (current_depth d4)
   goals met: 4 of 9
7. (apply_cnot l0 l1 p0 p1 d4)
   deleted: (rcnot l0 l1 d4)
   goals met: 5 of 9
8. (move_depth d4 d5)
   deleted: (current_depth d4)
   added: (current_depth d5)
   goals met: 5 of 9
9. (swap l1 l2 p1 p13 d5)
   deleted: (mapped l1 p1) (mapped l2 p13)
   added: (mapped l1 p13) (mapped l2 p1)
   goals met: 5 of 9
10. (apply_cnot l2 l0 p1 p0 d5)
   deleted: (rcnot l2 l0 d5)
   goals met: 6 of 9
11. (move_depth d5 d6)
   deleted: (current_depth d5)
   added: (current_depth d6)
   goals met: 6 of 9
12. (apply_cnot l2 l1 p1 p13 d6)
   deleted: (rcnot l2 l1 d6)
   goals met: 7 of 9
13. (move_depth d6 d7)
   deleted: (current_depth d6)
   added: (current_depth d7)
   goals met: 7 of 9
14. (swap l0 l2 p0 p1 d7)
   deleted: (mapped l0 p0) (mapped l2 p1)
   added: (mapped l0 p1) (mapped l2 p0)
   goals met: 7 of 9
15. (apply_cnot l2 l0 p0 p1 d7)
   deleted: (rcnot l2 l0 d7)
   goals met: 8 of 9
16. (move_depth d7 d8)
   deleted: (current_depth d7)
   added: (current_depth d8)
   goals met: 8 of 9
17. (apply_cnot l0 l1 p1 p13 d8)
   deleted: (rcnot l0 l1 d8)
   goals met: 9 of 9
